{
  "workshops": [
    {
      "title": "Intro to the Python Programming Language",
      "level": 1,
      "description": "Looking to learn one of the most popular industry-standard programming languages today? Python is a readable, easy-to-learn programming language used by everyone from small startups to tech giants, with applications from automation scripts to web servers. Our Intro to Python workshop will get you started on the basics of using this incredibly powerful and popular language. No experience needed. Recommended for first time coders and beginners.",
      "tracks": [1, 2]
    },
    {
      "title": "Intro to the Java Programming Language",
      "level": 1,
      "description": "The world runs on code, and Java is one of the most widely-used programming languages out there. Learn what Java is, its applications, and how to write your first lines of code in the Fundamentals of Java Workshop! Java is powerful and easy to learn, and traditionally has served as the entry point for those new to coding. No experience needed. Recommended for first time coders and beginners.",
      "tracks": [1, 2]
    },
    {
      "title": "Intro to the C++ Programming Language",
      "level": 1,
      "description": "This C++ workshop teaches fundamental programming concepts such as variables, data types, control structures, functions, and arrays. Participants will learn to write and debug C++ code and work on small programming projects. By the end of the workshop, attendees will have a basic understanding of programming with C++.",
      "tracks": [3]
    },
    {
      "title": "Intro to Web Development with HTML/CSS/JS",
      "level": 1,
      "description": "Websites are at the core of digital life today, and web development is an essential skill now more than ever. This workshop will equip you with all the skills needed to create websites with HTML, CSS, and JavaScript. No prior coding experience is required.",
      "tracks": [1, 3]
    },
    {
      "title": "Animation with Python Turtle",
      "level": 1,
      "description": "Learn the basics of animation using Python Turtle with AV Girls Who Code! Python Turtle is a great intro to Python and coding, and it's easy to learn. Our workshop is a fun way to get creative with coding, and no prior coding experience is necessary!",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to Algorithms and Data Structures with USACO",
      "level": 2,
      "description": "Algorithms and data structures are one of the core fundamentals every programmer is expected to be familiar with— even the big tech companies like Google and Facebook are seeking to hire people with adequate mastery of these concepts. Algorithms and data structures and competitive programming involve using problem solving skills such as algorithms, math, and logic to solve a structured programming problem using programming. In this workshop, you will be introduced on the fundamentals of Algorithms and Data strucutres and how they can be applied to USACO (USA Computing Olympiad).",
      "prereqs": "Prior experience with Java is recommended.",
      "tracks": [3]
    },
    {
      "title": "Intro to Cybersecurity",
      "level": 1,
      "description": "Cybersecurity allows one to protect their technology from any external attacks, keeping their data and private info safe. In this workshop, we will go through a brief intodroduction of the importance of Cybersecrity and steps you can take to stay protected. In addition we will introduce tools that will help with out task, and you will learn how to implement those skills in a CTF, or Capture the Flag.",
      "tracks": [2]
    },
    {
      "title": "Fundamentals of Electrical and Embedded Engineering",
      "level": 1,
      "description": "From microchips inside our computers and phones to navigation systems that keep aircrafts running, electrical engineering is responsible for keeping these important devices and our world running. The Electrical and Software division of the AVBotz robotics club at Amador will introduce you to the fundamentals of embedded engineering in this workshop—how to use a soldering iron, the basics of the C language, and how to wire up a basic circuit with an Arduino.",
      "prereqs": "Personal (non-chromebook) computer",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Drones: How They Fly and How to Fly Them",
      "level": 1,
      "description": "AmadorUAVs is a club based at Amador that builds autonomous aerial vehicles. Members of this club will be covering the basics concepts of how drones fly and the recent advancements that have led to the development of drones. In the workshop, students will also understand the controls associated with flying a drone and have the opportunity to fly a drone for themselves. Students will also be shown a flight demonstrations of Macron, a 5-foot long octocopter that AmadorUAVs has developed to compete in various events.",
      "tracks": [3]
    },
    {
      "title": "Frontend Web Development with Vue.js",
      "level": 1,
      "description": "Vue.js is a progressive web framework that makes developing complex websites significantly easier. This workshop is will serve as an introduction to Vue.js for people of various different skill levels.",
      "tracks": [1, 3]
    },
    {
      "title": "Frontend Development with React.js",
      "level": 2,
      "description": "React.js: Taking advantage of components and state management, this framework can be used to create dynamic websites with JavaScript. This technology is high in demand and is one of the most popular JavaScript framework. In this workshop students will learn how to leverage this powerful framework to create interactive UIs and elevate their website development skills.",
      "prereqs": "Prior HTML/CSS/JS experience recommended.",
      "tracks": [2]
    },
    {
      "title": "Intro to Machine Learning",
      "level": 2,
      "description": "Machine Learning is the next big thing in the tech industry. We see it all the time in from market predictions to finding patterns in unsolved mysteries. This course will teach you more than machine learning - it will teach you to think like an analyst.",
      "prereqs": "Recommended coding experience and personal (non-chromebook) computer/gmail",
      "tracks": [1, 2]
    },
    {
      "title": "Game Development",
      "level": 1,
      "description": "How can programming, art, music, and narrative combine to create a functioning game? In this workshop, students will be introduced to the basic process of game creation and will work with a free, online engine called Bitsy to create their own game! As Bitsy functions on conditional variables rather than full-fledged scripting, students do not need any background in coding to join.",
      "tracks": [3]
    },
    {
      "title": "Intro to CAD",
      "level": 1,
      "description": "Learn the basics of mechanical design through beginner software TinkerCAD. You will also learn the fundamental manufacturing processes that can bring your computer designs to life, while also being able to make your own custom keychain.",
      "tracks": [3]
    }
  ]
}
