{
  "workshops": [
    {
      "title": "Intro to the Python Programming Language",
      "level": 1,
      "description": "Looking to learn one of the most popular industry-standard programming languages today? Python is a readable, easy-to-learn programming language used by everyone from small startups to tech giants, with applications from automation scripts to web servers. Our Intro to Python workshop will get you started on the basics of using this incredibly powerful and popular language. No experience needed. Recommended for first time coders and beginners.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to the Java Programming Language",
      "level": 1,
      "description": "The world runs on code, and Java is one of the most widely-used programming languages out there. Learn what Java is, its applications, and how to write your first lines of code in the Fundamentals of Java Workshop! Java is powerful and easy to learn, and traditionally has served as the entry point for those new to coding. No experience needed. Recommended for first time coders and beginners.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to Web Development with HTML/CSS/JS",
      "level": 1,
      "description": "Websites are at the core of digital life today, and web development is an essential skill now more than ever. This workshop will equip you with all the skills needed to create websites with HTML, CSS, and JavaScript. No prior coding experience is required.",
      "tracks": [2, 3]
    },
    {
      "title": "Animation with Python Turtle",
      "level": 1,
      "description": "Learn the basics of animation using Python Turtle with AV Girls Who Code! Python Turtle is a great intro to Python and coding, and it's easy to learn. Our workshop is a fun way to get creative with coding, and no prior coding experience is necessary!",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to Algorithms and Data Structures with USACO",
      "level": 2,
      "description": "Algorithms and data structures are one of the core fundamentals every programmer is expected to be familiar with— even the big tech companies like Google and Facebook are seeking to hire people with adequate mastery of these concepts. Algorithms and data structures and competitive programming involve using problem solving skills such as algorithms, math, and logic to solve a structured programming problem using programming. In this workshop, you will be introduced on the fundamentals of Algorithms and Data strucutres and how they can be applied to USACO (USA Computing Olympiad). Prior experience with the Java is recommended.",
      "prereqs": "Prior coding experince recommended ",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to Cybersecurity",
      "level": 1,
      "description": "Cybersecurity allows one to protect their technology from any external attacks, keeping their data and private info safe. In this workshop, we will go through a brief intodroduction of the importance of Cybersecrity and steps you can take to stay protected. In addition we will introduce tools that will help with out task, and you will learn how to implement those skills in a CTF, or Capture the Flag.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Fundamentals of Electrical and Embedded Engineering",
      "level": 1,
      "description": "From microchips inside our computers and phones to navigation systems that keep aircrafts running, electrical engineering is responsible for keeping these important devices and our world running. The Electrical and Software division of the AVBotz robotics club at Amador will introduce you to the fundamentals of embedded engineering in this workshop—how to use a soldering iron, the basics of the C language, and how to wire up a basic circuit with an Arduino.",
      "prereqs": "Personal (non-chromebook) computer",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Server Building",
      "level": 1,
      "description": "Pleasanton Partners in Education (PPIE) has graciously awarded ACE Coding a grant to develop this workshop for its students. Servers are the backbone of the internet; they run websites, programs, virtual machines, and even game servers for video games. This workshop will cover all the fundamentals of assembling your very own server, from choosing the right components, to the building of the server itself. We will cover what each component does, and how it fits into the broader picture of a complete server. This workshop serves as an introduction into the world of enterprise computing. There will be a live demonstration of how to assemble the server and the installation of Linux OS.",
      "tracks": [2]
    },
    {
      "title": "Let's Go Racing: Intro to Robotics",
      "level": 2,
      "description": "Putting together your own radio-controlled car is a fun and interesting way to learn about fundamentals of robotics and embedded software! In this workshop, you'll learn to put together a fully functioning radio-controlled electric car, wire it up to a microcontroller, and program the microcontroller to take in inputs from a radio controller to spin motors! Prior basic C/C++ experience is recommended",
      "prereqs": "Personal (non-chromebook) computer; Recommended basic C/C++ knowledge",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Drones: How They Fly and How to Fly Them",
      "level": 1,
      "description": "AmadorUAVs is a club based at Amador that builds autonomous aerial vehicles. Members of this club will be covering the basics concepts of how drones fly and the recent advancements that have led to the development of drones. In the workshop, students will also understand the controls associated with flying a drone and have the opportunity to fly a drone for themselves. Students will also be shown a flight demonstrations of Macron, a 5-foot long octocopter that AmadorUAVs has developed to compete in various events.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Modern Web Development with Vue.js",
      "level": 1,
      "description": "This workshop is the first part of the \"Modern Web Development with Vue.js\" workshop series. The series is designed to take you from a completely new developer to one who has all the skills needed to build powerful web apps. The first workshop will start with the basics of HTML and CSS, and over the 3 workshops students will start enhancing their projects with Vue.js, a progressive web framework that makes developing complex websites significantly easier. Over the course of the workshop series, students will build a notion.so clone application, allowing them to apply all of the skills they learn throughout the series. Additionally, the final project will be open-ended, so students will be able to customize their projects as much as they'd like after the series.",
      "tracks": [1]
    },
    {
      "title": "Intermediate Website Development with Vue.js",
      "level": 2,
      "description": "This workshop is the second part of the \"Modern Web Development with Vue.js\" workshop series. The series is designed to take you from a completely new developer to one who has all the skills to build powerful web apps. The first workshop will start with the basics of HTML and CSS, and over the 3 workshops students will start enhancing their projects with Vue.js, a progressive web framework that makes developing complex websites significantly easier. Over the course of the workshop series, students will build a notion.so clone application, allowing them to apply all of the skills they learn throughout the series. Additionally, the final project will be open-ended, so students will be able to customize their projects as much as they'd like after the series.",
      "tracks": [2]
    },
    {
      "title": "Advanced Website Development with Vue.js",
      "level": 3,
      "description": "This workshop is the third part of the \"Modern Web Development with Vue.js\" workshop series. The series is designed to take you from a completely new developer to one who has all the skills to build powerful web apps. The first workshop will start with the basics of HTML and CSS, and over the 3 workshops students will start enhancing their projects with Vue.js, a progressive web framework that makes developing complex websites significantly easier. Over the course of the workshop series, students will build a notion.so clone application, allowing them to apply all of the skills they learn throughout the series. Additionally, the final project will be open-ended, so students will be able to customize their projects as much as they'd like after the series.",
      "tracks": [3]
    },
    {
      "title": "Frontend Development with React.js",
      "level": 2,
      "description": "React.js: Taking advantage of components and state management, this framework can be used to create dynamic websites with JavaScript. This technology is high in demand and is one of the most popular JavaScript framework. In this workshop students will learn how to leverage this powerful framework to create interactive UIs and elevate their website development skills. Prior HTML/CSS/JS experience recommended.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Applications of Machine Learning",
      "level": 3,
      "description": "Machine Learning is the next big thing in the tech industry. We see it all the time in from market predictions to finding patterns in unsolved mysteries. This course will teach you more than machine learning - it will teach you to think like an analyst.",
      "prereqs": "Recommended coding experience and preferabaly personal (non-chromebook) computer/gmail",
      "tracks": [1, 2, 3]
    }
  ]
}
