{
  "workshops": [
    {
      "title": "Intro to Electrical Engineering (AVBotz)",
      "level": 2,
      "prereqs": "None",
      "description": "Discover how Electrical Engineering powers the technology we use every day, from smartphones to appliances. Taught by Amador’s award-winning AVBotz robotics team, this workshop introduces students to electrical engineering through hands-on experience with real circuits, soldering, and foundational topics like current, voltage, and power.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Computer Vision with OpenCV (AVBotz)",
      "level": 2,
      "prereqs": "None",
      "description": "How do computers see the world? This exciting workshop, led by AVBotz, introduces the fundamentals of computer vision using OpenCV—the same library used in facial recognition and self-driving cars. Students will analyze and extract data from images using real-world applications.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to Web Development (HTML/CSS/JS)",
      "level": 1,
      "prereqs": "None",
      "description": "Want to build your own website from scratch? This beginner-friendly course introduces HTML, CSS, and JavaScript—the foundational tools of the web. Taught by ACE Coding alumni from UC Berkeley EECS, students will create interactive, responsive websites with no prior coding experience.",
      "tracks": [1, 2]
    },
    {
      "title": "Intermediate Web Development with Vue.js",
      "level": 2,
      "prereqs": "Basic knowledge of HTML/CSS/JS or completion of Intro to Web Dev",
      "description": "Level up your web skills by learning Vue.js, a powerful JavaScript framework for building modern web apps. Taught by ACE Coding alumni, this workshop is perfect for students with basic knowledge of HTML/CSS/JS or who have completed the Intro to Web Dev course.",
      "tracks": [3]
    },
    {
      "title": "Intro to LEGO Robotics (FIRST LEGO League)",
      "level": 1,
      "prereqs": "None",
      "description": "Dive into the world of LEGO Robotics and Python programming! With guidance from NorCal’s 1st Place FLL Champions, students will design, build, and code LEGO robots to solve real-world challenges. No experience needed—just curiosity and creativity.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to Python Programming",
      "level": 1,
      "prereqs": "None",
      "description": "Python is one of the most popular and powerful programming languages—used in AI, data analysis, automation, and more. This beginner workshop introduces core concepts with no prerequisites, making it perfect for first-time coders who want to build their future with code.",
      "tracks": [1, 2, 3]
    },
    {
      "title": "Intro to Java / APCSA Prep",
      "level": 1,
      "prereqs": "None",
      "description": "Thinking about taking AP Computer Science A? This workshop introduces students to Java—the language used in the APCSA curriculum. Learn core programming concepts to build a solid foundation for high school and beyond.",
      "tracks": [1, 2]
    },
    {
      "title": "Applications of Machine Learning",
      "level": 2,
      "prereqs": "Some coding experience recommended",
      "description": "Explore the rapidly growing field of Machine Learning with real-world examples in market prediction and AI. Taught by Amador’s AI Club, this workshop teaches students to think like analysts.",
      "tracks": [1, 2]
    },
    {
      "title": "Server Building",
      "level": 2,
      "prereqs": "None (comfort with computers recommended)",
      "description": "Ever wanted to host your own website or run a file server? Learn how to build and configure your own server from scratch. This hands-on workshop is perfect for tech enthusiasts.",
      "tracks": [1, 3]
    },
    {
      "title": "EarSketch Music Technology (GWC)",
      "level": 1,
      "prereqs": "None",
      "description": "Code to the beat with EarSketch! This creative workshop teaches Python through music, allowing students to compose songs while learning coding basics like loops and functions. Taught by Amador’s Girls Who Code club—perfect for all experience levels.",
      "tracks": [2, 3]
    }
  ]
}
